---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PhaseFilter
source: html/5b5cf504-33da-32ae-4371-37016f3c1a19.htm
---
# PhaseFilter Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.